hissokas/string-main-stm32f407-freertos/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include <string.h>
#include "arm_math.h"
#include "SHT1X.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;

SPI_HandleTypeDef hspi2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart6_rx;

osThreadId TASK_LEDHandle;
osThreadId TASK_SERIALHandle;
osThreadId TASK_CANHandle;
osThreadId TASK_GPRSHandle;
osThreadId TASK_NEPORTHandle;
osSemaphoreId BinarySem_serialHandle;
osSemaphoreId BinarySem_gprsHandle;
osSemaphoreId BinarySem_neportHandle;
osSemaphoreId CountingSem_canHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
TickType_t PreviousWakeTime;                               
uint8_t serial_rxbuf[BUFFER_SIZE]; 
uint8_t neport_rxbuf[BUFFER_SIZE]; 
uint8_t gprs_rxbuf[BUFFER_SIZE]; 
uint8_t can_txbuf[8] = {1,2,3,4,5,6,7,8};
uint8_t can_rxbuf[128];
uint8_t serial_rxlen = 0; 
uint8_t neport_rxlen = 0; 
uint8_t gprs_rxlen = 0; 
uint8_t data_to_send[SUB_BOARD][81];
uint8_t main_ID = 0x01;
uint16_t humi_val_i = 0,temp_val_i = 0;
SHT1x sht1x; 

char gprs_connect_str[] = "AT+CIPSTART=\"TCP\",\"xxx.xxx.xxx.xxx\",\"50000\"\r\n";
char gprs_send_str[] = "AT+CIPSEND=81\r\n";
char gprs_disconnect_str[] = "AT+CIPCLOSE\r\n";
char gprs_shut_str[] = "AT+CIPSHUT\r\n";
char gprs_noecho_str[] = "ATE0\r\n";
char gprs_handshake_str[] = "AT\r\n";

char rt_OK[] = "OK";
char rt_CONNECT_OK[] = "CONNECT OK";
char rt_SEND_OK[] = "SEND OK";

enum{
	HANDSHAKE = 0,
	STOPECHO,
	CONNECT,
	TCPACK,
	WAITFORCMD,
	SEND,
	WAITFORSDC,
	TCPCLOSE,
	SHUT
};
uint8_t GPRSSTATE = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_CAN1_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART6_UART_Init(void);
void FUNC_LED(void const * argument);
void FUNC_SERIAL(void const * argument);
void FUNC_CAN(void const * argument);
void FUNC_GPRS(void const * argument);
void FUNC_NEPORT(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void data_calc(void);
void get_SHT1x(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void data_calc()
{
	int i,s,m,j;
	float count;
	float adc;
	float frequency;
	float temp,temp_log;
	float A;
	float B;
	float C;
	
	A = 0.0014051f;
  B = 0.0002369f;
  C = 0.0000001019f;
	
	for(i = 0;i < SUB_BOARD;i ++)
	{
		data_to_send[i][0] = 0x53;
		data_to_send[i][1] = 0x01;
		data_to_send[i][2] = 0x02;
		data_to_send[i][3] = 0x03;
		data_to_send[i][4] = 0x04;
		data_to_send[i][5] = 0x05;
		data_to_send[i][6] = 0x06;
		data_to_send[i][7] = main_ID + i;
		
		s=8;
		
		for(m = 0;m < 2;m ++)
		{   
			data_to_send[i][s] = m;s++;
			for(j = 0;j < 8;j ++)
			{
				count = can_rxbuf[j * 4 + m * 32 + i * 64]*256 + can_rxbuf[j * 4 + m * 32 + i * 64 + 1];
				frequency = 10000000.0f / count;
				
