hissokas/string-main-stm32f407-freertos/Src/main.c
				adc = (can_rxbuf[j * 4 + m * 32 + i * 64 + 2]*256 + can_rxbuf[j * 4 + m * 32 + i * 64 + 3])*4.5185f;
				temp_log = log(adc);
				temp = 1.0f / (A + B * temp_log + C * temp_log * temp_log * temp_log) - 273.2f; 
				
				frequency = frequency * 10;
				temp = temp * 100;
				
				data_to_send[i][s] = (uint16_t)(frequency) >> 8;s++;
				data_to_send[i][s] = (uint16_t)(frequency);     s++;
				data_to_send[i][s] = (uint16_t)(temp) >> 8;     s++; 
				data_to_send[i][s] = (uint16_t)(temp);          s++;						
			}
		}
		
		data_to_send[i][s] = 0x00;s++;
		data_to_send[i][s] = 0x00;s++;

		data_to_send[i][s] = sht1x.Humidity>>8;s++;
		data_to_send[i][s] = sht1x.Humidity;s++;
			
		data_to_send[i][s] = sht1x.Temperature>>8;s++;
		data_to_send[i][s] = sht1x.Temperature;s++;
			
		data_to_send[i][s]=  'E';s++;
	}
}

void get_SHT1x()
{
	uint8_t error = 0, checksum;
	uint16_t T_Value=0,H_Value=0;
	
	error+=SHT1x_Measure( &T_Value,&checksum,0);  //measure temperature 
  error+=SHT1x_Measure( &H_Value,&checksum,1);  //measure humidity
			
  if(error != 0)
		SHT1x_Reset(); //通讯故障,复位传感器
  else
  {
		sht1x.T_Result = T_Value;
    sht1x.H_Result = H_Value;
    SHT1X_Caculation1((float*)&sht1x.T_Result, (float*)&sht1x.H_Result ); 
           
    sht1x.Temperature=sht1x.T_Result;
    sht1x.Humidity=(uint16_t)sht1x.H_Result; 
  }
}
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
  uint8_t value = 0;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_CAN1_Init();
  MX_SPI2_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_USART6_UART_Init();

  /* USER CODE BEGIN 2 */
	__HAL_UART_ENABLE_IT(&huart6, UART_IT_IDLE); 
	__HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);
	__HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_11, GPIO_PIN_SET);

	if(!SHT1X_read_statusreg(&value))
  { 
		if(value&0x07)
    {
			for(value=5;value!=0;value--)
      { 
				if(!SHT1X_write_statusreg(0)) break;
        else SHT1X_softreset();
      }
    }
  }
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* definition and creation of BinarySem_serial */
  osSemaphoreDef(BinarySem_serial);
  BinarySem_serialHandle = osSemaphoreCreate(osSemaphore(BinarySem_serial), 1);

  /* definition and creation of BinarySem_gprs */
  osSemaphoreDef(BinarySem_gprs);
  BinarySem_gprsHandle = osSemaphoreCreate(osSemaphore(BinarySem_gprs), 1);

  /* definition and creation of BinarySem_neport */
  osSemaphoreDef(BinarySem_neport);
  BinarySem_neportHandle = osSemaphoreCreate(osSemaphore(BinarySem_neport), 1);

  /* definition and creation of CountingSem_can */
  osSemaphoreDef(CountingSem_can);
  CountingSem_canHandle = osSemaphoreCreate(osSemaphore(CountingSem_can), 3);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
	xSemaphoreTake(BinarySem_serialHandle,portMAX_DELAY);
	xSemaphoreTake(BinarySem_gprsHandle,portMAX_DELAY);
	xSemaphoreTake(BinarySem_neportHandle,portMAX_DELAY);
	
	xSemaphoreTake(CountingSem_canHandle,portMAX_DELAY);
	xSemaphoreTake(CountingSem_canHandle,portMAX_DELAY);
	xSemaphoreTake(CountingSem_canHandle,portMAX_DELAY);
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of TASK_LED */
  osThreadDef(TASK_LED, FUNC_LED, osPriorityLow, 0, 128);
  TASK_LEDHandle = osThreadCreate(osThread(TASK_LED), NULL);

  /* definition and creation of TASK_SERIAL */
  osThreadDef(TASK_SERIAL, FUNC_SERIAL, osPriorityBelowNormal, 0, 128);
  TASK_SERIALHandle = osThreadCreate(osThread(TASK_SERIAL), NULL);

  /* definition and creation of TASK_CAN */
  osThreadDef(TASK_CAN, FUNC_CAN, osPriorityNormal, 0, 128);
  TASK_CANHandle = osThreadCreate(osThread(TASK_CAN), NULL);

  /* definition and creation of TASK_GPRS */
  osThreadDef(TASK_GPRS, FUNC_GPRS, osPriorityBelowNormal, 0, 128);
  TASK_GPRSHandle = osThreadCreate(osThread(TASK_GPRS), NULL);

  /* definition and creation of TASK_NEPORT */
  osThreadDef(TASK_NEPORT, FUNC_NEPORT, osPriorityBelowNormal, 0, 128);
  TASK_NEPORTHandle = osThreadCreate(osThread(TASK_NEPORT), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 144;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

