hissokas/string-main-stm32f407-freertos/Src/main.c
  /*Configure GPIO pins : PC13 PC14 PC15 PC0 
                           PC1 PC2 PC3 PC4 
                           PC5 PC10 */
  GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_0 
                          |GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4 
                          |GPIO_PIN_5|GPIO_PIN_10;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : PA0 PA1 PA4 PA5 
                           PA6 PA7 PA15 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_4|GPIO_PIN_5 
                          |GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB0 PB1 PB12 PB4 
                           PB5 PB6 PB7 PB8 
                           PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_12|GPIO_PIN_4 
                          |GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8 
                          |GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PD8 PD10 PD12 PD13 
                           PD6 PD7 */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_10|GPIO_PIN_12|GPIO_PIN_13 
                          |GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : PD9 PD2 PD3 PD4 
                           PD5 */
  GPIO_InitStruct.Pin = GPIO_PIN_9|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4 
                          |GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : PC12 */
  GPIO_InitStruct.Pin = GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* FUNC_LED function */
void FUNC_LED(void const * argument)
{

  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_RESET);
		osDelay(1000);
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
		osDelay(1000);
  }
  /* USER CODE END 5 */ 
}

/* FUNC_SERIAL function */
void FUNC_SERIAL(void const * argument)
{
  /* USER CODE BEGIN FUNC_SERIAL */
	int i;
	BaseType_t pdsem = pdFALSE;
	HAL_UART_Receive_DMA(&huart6,serial_rxbuf,BUFFER_SIZE);
  /* Infinite loop */
  for(;;)
  {
		pdsem = xSemaphoreTake(BinarySem_serialHandle,portMAX_DELAY);
		
		//HAL_UART_Transmit(&huart1,serial_rxbuf,serial_rxlen,1000); //测试GPRS用，之后记得注掉
		
		if(pdsem == pdTRUE)
		{
			if(strstr((char *)serial_rxbuf,"REQUEST FOR DATA!") != NULL)
				;
			else 
			{
				HAL_UART_Receive_DMA(&huart6,serial_rxbuf,BUFFER_SIZE);
				continue;
			}
		}
		xSemaphoreGive(CountingSem_canHandle);
		for(i = 0;i < SUB_BOARD;i ++)
		{
			HAL_UART_Transmit(&huart6,&data_to_send[i][0],81,1000);
		}
		memset(serial_rxbuf,0,sizeof(serial_rxbuf));
		HAL_UART_Receive_DMA(&huart6,serial_rxbuf,BUFFER_SIZE);
  }
  /* USER CODE END FUNC_SERIAL */
}

/* FUNC_CAN function */
void FUNC_CAN(void const * argument)
{
  /* USER CODE BEGIN FUNC_CAN */
	int i,j,can_error_flag;
	uint8_t *pcan_rxbuf;
	CanTxMsgTypeDef TxMessage;
	CanRxMsgTypeDef RxMessage;
	CAN_FilterConfTypeDef  sFilterConfig;
	
	hcan1.pTxMsg = &TxMessage;
	hcan1.pRxMsg = &RxMessage;
	sFilterConfig.FilterNumber = 0;
  sFilterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilterConfig.FilterScale = CAN_FILTERSCALE_32BIT;
  sFilterConfig.FilterIdHigh = 0x0000;
  sFilterConfig.FilterIdLow = 0x0000;
  sFilterConfig.FilterMaskIdHigh = 0x0000;
  sFilterConfig.FilterMaskIdLow = 0x0000;
  sFilterConfig.FilterFIFOAssignment = 0;
  sFilterConfig.FilterActivation = ENABLE;
  sFilterConfig.BankNumber = 14;
  HAL_CAN_ConfigFilter(&hcan1, &sFilterConfig);
	
	hcan1.pTxMsg->IDE = CAN_ID_STD;
	hcan1.pTxMsg->DLC = 8;
	hcan1.pTxMsg->RTR = CAN_RTR_DATA;
	memcpy(hcan1.pTxMsg->Data,can_txbuf,8);

  /* Infinite loop */
  for(;;)
  {
    xSemaphoreTake(CountingSem_canHandle,portMAX_DELAY);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
		get_SHT1x();
		hcan1.pTxMsg->StdId = 0x01;
		HAL_CAN_Transmit(&hcan1, 1000);
		HAL_Delay(2000);
		pcan_rxbuf = &can_rxbuf[0];
		for(i = 0;i < 2 * SUB_BOARD;i ++)
		{
			hcan1.pTxMsg->StdId = 2 + ((i + 1) << 4);
			HAL_CAN_Transmit(&hcan1, 1000);
			HAL_Delay(10);
			can_error_flag = 0;
			for(j = 0;j < 4;j ++)
			{
				if(HAL_CAN_Receive(&hcan1, CAN_FIFO0,100) == HAL_OK)
				{
					memcpy(pcan_rxbuf + j * 8,hcan1.pRxMsg->Data,8);
				}
				else
				{
					can_error_flag = i + 1;
					break;
				}
			}
			pcan_rxbuf += 32;
		}
		data_calc();
		memset(can_rxbuf,0,sizeof(can_rxbuf));
  }
  /* USER CODE END FUNC_CAN */
}

/* FUNC_GPRS function */
void FUNC_GPRS(void const * argument)
{
  /* USER CODE BEGIN FUNC_GPRS */
	int send_count = 0, send_flag = 0;
	BaseType_t pdsem = pdFALSE;
	HAL_UART_Receive_DMA(&huart1,gprs_rxbuf,BUFFER_SIZE);
	osDelay(20000);
	HAL_UART_Transmit(&huart1,(uint8_t *)gprs_noecho_str,strlen(gprs_noecho_str),1000);
  /* Infinite loop */
 for(;;)
  {
    pdsem = xSemaphoreTake(BinarySem_gprsHandle,portMAX_DELAY);
		//HAL_UART_Transmit(&huart6,gprs_rxbuf,gprs_rxlen,1000);
		if(pdsem == pdTRUE)
		{
			if((strstr((char *)gprs_rxbuf,"+PDP: DEACT") != NULL) || (strstr((char *)gprs_rxbuf,"CLOSED") != NULL))
			{
				GPRSSTATE = SHUT;
				HAL_UART_Transmit(&huart1,(uint8_t *)gprs_shut_str,strlen(gprs_shut_str),1000);
			}
			else
			{
				switch(GPRSSTATE)
				{
					case CONNECT:
					{
						if(strstr((char *)gprs_rxbuf,"OK") != NULL)
							GPRSSTATE = TCPACK;
						break;
					}
					case TCPACK:
					{
						if(strstr((char *)gprs_rxbuf,"CONNECT OK") || (strstr((char *)gprs_rxbuf,"ALREADY CONNECT") != NULL))
							GPRSSTATE = WAITFORCMD;
						else if(strstr((char *)gprs_rxbuf,"CONNECT FAIL") || (strstr((char *)gprs_rxbuf,"+CME ERROR") != NULL))
						{
							GPRSSTATE = SHUT;
							HAL_UART_Transmit(&huart1,(uint8_t *)gprs_shut_str,strlen(gprs_shut_str),1000);
						}
						break;
					}
					case HANDSHAKE:
					{
						if(strstr((char *)gprs_rxbuf,"ATE0") != NULL)
						{
							GPRSSTATE = CONNECT;
							HAL_UART_Transmit(&huart1,(uint8_t *)gprs_connect_str,strlen(gprs_connect_str),1000);
						}
						break;
					}
					case SHUT:
					{
						osDelay(5000);
						if(strstr((char *)gprs_rxbuf,"SHUT OK") != NULL)
						{
							GPRSSTATE = CONNECT;
							HAL_UART_Transmit(&huart1,(uint8_t *)gprs_connect_str,strlen(gprs_connect_str),1000);
						}
						break;
					}
					case WAITFORCMD:
					{
						if(gprs_rxlen >= 17)
						{
							//if(strstr((char *)gprs_rxbuf,"S") != NULL)
							if(strstr((char *)gprs_rxbuf,"REQUEST FOR DATA!") != NULL)
							{
								xSemaphoreGive(CountingSem_canHandle);
								GPRSSTATE = SEND;
								HAL_UART_Transmit(&huart1,(uint8_t *)gprs_send_str,strlen(gprs_send_str),1000);
								HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);
							}
						}
						else if(send_flag == 1)
						{
								GPRSSTATE = SEND;
								HAL_UART_Transmit(&huart1,(uint8_t *)gprs_send_str,strlen(gprs_send_str),1000);
								HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);
						}
						break;
					}
					case SEND:
					{
						if(strstr((char *)gprs_rxbuf,">") != NULL)
						{
							GPRSSTATE = WAITFORSDC;
							HAL_UART_Transmit(&huart1,&data_to_send[send_count][0],81,1000);
							send_count ++;
						}
						break;
					}
					case WAITFORSDC:
					{
						if(strstr((char *)gprs_rxbuf,"SEND OK") != NULL)
						{
							GPRSSTATE = WAITFORCMD;
							if(send_count <  SUB_BOARD)
							{
								osDelay(1000);
								send_flag = 1;
								xSemaphoreGive(BinarySem_gprsHandle);
							}
							else
							{
								send_count = 0;
								send_flag = 0;
							}
						}
						else if((strstr((char *)gprs_rxbuf,"SEND FAIL") != NULL) || (strstr((char *)gprs_rxbuf,"+CME ERROR") != NULL))
						{
							GPRSSTATE = SHUT;
							HAL_UART_Transmit(&huart1,(uint8_t *)gprs_shut_str,strlen(gprs_shut_str),1000);
						}
						break;
					}
					default: break;
				}
			}
		}
		memset(gprs_rxbuf,0,sizeof(gprs_rxbuf));
		HAL_UART_Receive_DMA(&huart1,gprs_rxbuf,BUFFER_SIZE);
  }
  /* USER CODE END FUNC_GPRS */
}

