hissokas/string-main-stm32f407-freertos/Src/main.c
/* FUNC_NEPORT function */
void FUNC_NEPORT(void const * argument)
{
  /* USER CODE BEGIN FUNC_NEPORT */
	int i;
	BaseType_t pdsem = pdFALSE;
	HAL_UART_Receive_DMA(&huart2,neport_rxbuf,BUFFER_SIZE);
  /* Infinite loop */
  for(;;)
  {
    pdsem = xSemaphoreTake(BinarySem_neportHandle,portMAX_DELAY);
		if(pdsem == pdTRUE)
		{
			if(strstr((char *)neport_rxbuf,"REQUEST FOR DATA!") != NULL)
				;
			else 
			{
				HAL_UART_Receive_DMA(&huart2,neport_rxbuf,BUFFER_SIZE);
				continue;
			}
		}
		xSemaphoreGive(CountingSem_canHandle);
		for(i = 0;i < SUB_BOARD;i ++)
		{
			HAL_UART_Transmit(&huart2,&data_to_send[i][0],81,1000);
		}
		memset(neport_rxbuf,0,sizeof(neport_rxbuf));
		HAL_UART_Receive_DMA(&huart2,neport_rxbuf,BUFFER_SIZE);
  }
  /* USER CODE END FUNC_NEPORT */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM4 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM4) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);
	return ;
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
